tests/org.jboss.tools.teiid.ui.bot.test/resources/xml/WebServiceCreationTest/InsertRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ProductInfo="http://teiid.org/ProductInfo">
    <soap:Header/>
    <soap:Body>
        <ProductInfo:ProductInput>
            <ProductInfo:ProductInput_Instance>
                <ProductInfo:INSTR_ID>XXX1234</ProductInfo:INSTR_ID>
                <ProductInfo:SYMBOL_TYPE>1</ProductInfo:SYMBOL_TYPE>
                <ProductInfo:SYMBOL>TTT</ProductInfo:SYMBOL>
                <ProductInfo:NAME>Test Corp</ProductInfo:NAME>
                <ProductInfo:ISDJI>0</ProductInfo:ISDJI>
                <ProductInfo:ISSP500>0</ProductInfo:ISSP500>
                <ProductInfo:ISNAS100>0</ProductInfo:ISNAS100>
                <ProductInfo:ISAMEXINT>0</ProductInfo:ISAMEXINT>
            </ProductInfo:ProductInput_Instance>
        </ProductInfo:ProductInput>
    </soap:Body>
</soap:Envelope>